clc
clear
%%
%求传感器实验数据 灵敏度 k，非线性误差(线性度) rL，迟滞 rH，重复性 rR
%%
%输入数据 X：质量  Y：电压
m=11;n=3;   %m个测量点，n个来回 （记得改）
x1=[0 0.2 0.4 0.6 0.8 1.0 1.2 1.4 1.6 1.8 2.0];       %正行程的m个测量点
yu=[0 0.14 0.56 0.99 1.40 1.79 2.19 2.54 2.86 3.12 3.38;
    0 0.15 0.56 1.00 1.41 1.79 2.20 2.55 2.87 3.12 3.39; 
    0 0.14 0.56 1.00 1.41 1.80 2.19 2.54 2.86 3.12 3.40];  %正行程测量数据
yd=[0 0.13 0.56 0.99 1.40 1.80 2.20 2.54 2.86 3.12 3.38;
    0 0.14 0.56 1.00 1.41 1.79 2.19 2.54 2.87 3.11 3.38;
    0 0.15 0.56 0.99 1.41 1.80 2.19 2.55 2.86 3.12 3.40];  %反行程测量数据
x2=x1; 
for i=1:(2*n-1)             %扩展到全部的测点，2*n个横坐标轴（X)
    x2=vertcat(x2,x1);
    i=i+1;
end                       
y=[yu;yd];            %所有测量数据（Y）组成n×m矩阵
xmean=mean(mean(x2));     %x2的总均值
ymean=mean(mean(y)) ;    %y的总均值
%%
%以下为求非线性误差与灵敏度
lxx=sum(sum((x2-xmean).^2));  
lxy=sum(sum((x2-xmean).*(y-ymean)));  
k=lxy./lxx    %拟合直线斜率 即灵敏度（实验使用的是线性传感器）         
b=ymean-k*xmean
X=x1;
Y1=k.*X+b;               %拟合直线
Y=Y1;
for j=1:(2*n-1)
    Y=vertcat(Y,Y1);
    j=j+1;
end                        %Y由一维扩展到2n×m矩阵
dLmax=max(max(abs(y-Y)));   %曲线与直线的最大差值
yFS=max(max(y))-min(min(y));  %满量程输出
rL=dLmax./yFS       %线性度 即非线性误差
%%
%求迟滞
DyiH=abs(yu-yd);     %正反行程的偏差
DHmax=max(max(DyiH));        %正反行程的最大偏差
rH=DHmax./yFS                %迟滞误差
%%
%重复性
wu=max(yu)-min(yu); %正行程极差
wd=max(yd)-min(yd);%反行程极差
rR=max(max(wu),max(wd))/(2*yFS)  %重复性指标      